{
  "scheming_version": 1,
  "dataset_type": "dataset",
  "about": "An implementation of the DCAT-AP Switzerland Schema",
  "about_url": "https://github.com/ogdch/ckanext-switzerland",
  "form_languages": ["en","de", "fr", "it"],
  "dataset_fields": [
    {
      "field_name": "title_for_slug",
      "preset": "title",
      "form_snippet": "title.html",
      "label": {
        "en": "Title for URL of the dataset",
        "de": "Titel für die URL des Datasets",
        "fr": "Titre pour le URL du Dataset",
        "it": "Titolo per l’URL del dataset"
      },
      "form_placeholder": {
        "en": "Title for generating the URL of the dataset",
        "de": "Titel für das Erzeugen des Slugs (URL) des Datasets",
        "fr": "Titre pour créer le Slug (URL) du dataset",
        "it": "Titolo per creare lo Slug (URL) del dataset"
      },
      "help_text": {
        "en": "This title field is only used for the first creation of the dataset. Later, it is automatically filled from the multilingual title fields.",
        "de": "Dieses Titelfeld dient nur zum ersten Anlegen des Datasets. Später wird es aus den mehrsprachigen Titelfeldern automatisch besetzt.",
        "fr": "Ce champ est utilisé que pour la création d’un dataset dans le système. Il ne sera pas montré sur le web.",
        "it": "Questo titolo è necessario per la creazione del dataset nel sistema. Non sarà visualizzato sul web."
      }
    },
    {
      "field_name": "name",
      "preset": "dataset_slug",
      "label": {
        "en": "Slug",
        "de": "Slug",
        "fr": "Slug",
        "it": "Slug"
      }
    },
    {
      "field_name": "title",
      "preset": "multilingual_text_full",
      "mark_required": true,
      "section_title": {
        "en": "Dataset",
        "de": "Dataset",
        "fr": "Jeu de données",
        "it": "Dataset"
      },
      "fieldgroup": {
        "en": "Title",
        "de": "Titel",
        "fr": "Titre",
        "it": "Titolo"
      },
      "help_text": {
        "de": "Bitte geben Sie einen Titel Ihres Datasets ein. Bitte besetzen Sie mindestens eine Landessprache (Bundesstellen sollen zwei Landessprachen besetzen) und Englisch. (Der Eintrag in Englisch wird bei der Weitergabe Ihres Datasets an das europäische Datenportal benötigt.)",
        "en": "Please enter a title of your dataset. Please fill in at least one national language (Federal offices should fill in two national languages) and English. (The entry in English is required when forwarding your dataset to the European Data Portal).",
        "fr": "Veuillez entrer un titre pour votre jeu de données. Veuillez remplir au moins une langue nationale (les Office fédéraux doivent remplir deux langues nationales) et l'anglais. (L'entrée en anglais est requise lors de la transmission de l’ensemble de données au portail européen de données).",
        "it": "La preghiamo di inserire un titolo del tuo set di dati. Si prega di compilare almeno una lingua nazionale (gli uffici federali dovrebbero compilare due lingue nazionali) e l'inglese. (L’informazione in inglese è necessaria per inoltrare il dataset al portale europeo dei dati)."
      },
      "label": {
        "en": "Title",
        "de": "Titel",
        "fr": "Titre",
        "it": "Titolo"
      },
      "form_placeholder": {
        "en": "Title of the Dataset",
        "de": "Titel des Datasets",
        "fr": "Titre",
        "it": "Titolo"
      }
    },
    {
      "field_name": "identifier",
      "validators": "ogdch_unique_identifier",
      "required": true,
      "fieldgroup": {
        "en": "Dataset Identifier",
        "de": "Dataset Identifier",
        "fr": "Dataset Identifier",
        "it": "Dataset Identifier"
      },
      "label": {
        "en": "Identifier",
        "de": "Identifier",
        "fr": "Identifier",
        "it": "Identifier"
      },
      "help_text": {
        "en": "The identifier ensures that the dataset is linked to your organisation. To define it you can use for example the ID from your source system or define any ID for the dataset. Please make sure that your dataset is assigned to the correct organisation. Important: Do not change the identifier after the dataset has been published. Otherwise your data can no longer be clearly assigned.",
        "de": "Der Identifier sorgt dafür, dass das Dataset mit Ihrer Organisation verknüpft wird. Dafür können Sie beispielsweise die ID aus Ihrem Quellsystem verwenden oder eine beliebige ID fürs Dataset definieren. Bitte stellen Sie sicher, dass Ihr Dataset der richtigen Organisation zugeteilt ist.Wichtig: Verändern Sie den Identifier nicht mehr, nachdem das Dataset publiziert ist. Ansonsten können Ihre Daten nicht mehr eindeutig zugeordnet werden.",
        "fr": "L'identifier garantit que le jeu de données soit lié à votre organisation. Par exemple, vous pouvez utiliser l'ID de votre système source ou définir n'importe quel ID pour l'ensemble de données. Veuillez vous assurer que votre jeu de données est attribué à la bonne organisation. Important : ne modifiez pas l'identifier après la publication de l'ensemble de données. Sinon, vos données ne peuvent plus être attribuées de manière unique.",
        "it": "L'identifier assicura che il dataset sia collegato all’organizzazione corretta. L’identifier può essere ad esempio creato a partire dall’ID dal sistema di origine o definendo un ID qualsiasi per il dataset. È importante assicurarsi che il dataset sia assegnato all'organizzazione corretta. Importante: non cambiare l'identifier dopo che il dataset è stato pubblicato. Altrimenti i vostri dati non possono più essere assegnati in modo univoco."
      },
      "form_placeholder": "123..@organization"
    },
    {
      "field_name": "owner_org",
      "preset": "dataset_organization",
      "label": {
        "en": "Organization",
        "de": "Organisation",
        "fr": "Organisation",
        "it": "Organizzazione"
      },
      "help_text": {
        "en": "The organization that the dataset belongs to.",
        "de": "Die Organisation zu welcher das Dataset gehört.",
        "fr": "L'organisation à laquelle appartient l'ensemble de données.",
        "it": "L'organizzazione alla quale il dataset appartiene."
      }
    },
    {
      "field_name": "scheduled",
      "preset": "ogdch_date",
      "label": {
          "en": "Schedule the publication of the dataset",
          "de": "Veröffentlichung des Datasets terminieren",
          "fr": "Planifier la publication du jeu de données",
          "it": "Pianificare la pubblicazione del dataset"
      },
      "help_text": {
        "en": "Set visibility to \"Draft\" to schedule the automatic publication of the dataset. By setting the visibility to \"Published\", the dataset will be published directly.",
        "de": "Sichtbarkeit auf “Entwurf” setzen, um die automatische Veröffentlichung des Datasets zu planen. Wenn Sie die Sichtbarkeit auf “Veröffentlicht” setzen, wird das Dataset direkt veröffentlicht.",
        "fr": "Définissez la visibilité sur \"Draft\" pour programmer la publication automatique de jeu de données. Si vous choisissez la visibilité \"Publié\", le jeu de données sera publié directement.",
        "it": "Impostare la visibilità su \"Draft\" per programmare la pubblicazione automatica del set di dati. Impostando la visibilità su \"Pubblicato\", il set di dati sarà pubblicato direttamente"
      }
    },
    {
      "field_name": "display_name",
      "preset": "multilingual_text",
      "form_snippet": null,
      "label": {
        "en": "Display name",
        "de": "Anzeigename",
        "fr": "Nom d'affichage",
        "it": "Nome visualizzato"
      }
    },
    {
      "field_name": "notes",
      "preset": "multilingual_output",
      "form_snippet": null,
      "label": {
        "en": "Description",
        "de": "Beschreibung",
        "fr": "Description",
        "it": "Descrizione"
      }
    },
    {
      "field_name": "description",
      "preset": "multilingual_markdown",
      "mark_required": true,
      "section_title": {
        "en": "Dataset Information",
        "de": "Dataset Information",
        "fr": "Informations relatives au jeu de données",
        "it": "Informazioni relative al dataset"
      },
      "fieldgroup": {
        "en": "Description",
        "de": "Beschreibung",
        "fr": "Description",
        "it": "Descrizione"
      },
      "help_text": {
        "de": "Bitte geben Sie eine Beschreibung für Ihr Datasets ein. Bitte besetzen Sie mindestens eine Landessprache (Bundesstellen soll mindestens zwei Landessprachen besetzen) und Englisch. (Der Eintrag in Englisch wird bei der Weitergabe Ihres Datasets an das europäische Datenportal benötigt.)",
        "en": "Please enter a description for your dataset. Please fill in at least one national language (federal offices should fill in at least two national languages) and English. (The entry in English is required when submitting your dataset to the European Data Portal.)",
        "fr": "Veuillez entrer une description pour votre jeu de données. Veuillez remplir au moins une langue nationale (les offices fédéraux doivent remplir au moins deux langues nationales) et l'anglais. (La saisie en anglais est requise lors de la soumission de votre ensemble de données au portail européen de données.)",
        "it": "Inserire una descrizione per il dataet. Si prega di compilare almeno una lingua nazionale (gli uffici ederali dovrebbero compilare almeno due lingue nazionali) e l'inglese. (La voce in inglese è necessaria quando si presenta il vostro set di dati al portale europeo dei dati.)"
      },
      "label": {
        "en": "Description",
        "de": "Beschreibung",
        "fr": "Description",
        "it": "Descrizione"
      },
      "form_placeholder": {
        "en": "Description",
        "de": "Beschreibung",
        "fr": "Description",
        "it": "Descrizione"
      }
    },
    {
      "field_name": "issued",
      "preset": "ogdch_date",
      "mark_required": true,
      "section_title": {
        "en": "Data",
        "de": "Daten",
        "fr": "Données",
        "it": "Data"
      },
      "fieldgroup": {
        "en": "Issued date",
        "de": "Erstellungsdatum",
        "fr": "Date de publication",
        "it": "Data di pubblicazione"
      },
      "label": {
        "en": "Issued date",
        "de": "Erstellungsdatum",
        "fr": "Date de publication",
        "it": "Data di pubblicazione"
      },
     "help_text": {
       "en": "The creation date is a mandatory field. This is the date of the first publication in the source system of this dataset. If this is not known, use the date of the planned first publication on opendata.swiss.",
       "de": "Das Erstellungsdatum ist ein Pflichtfeld. Damit ist das Datum der ersten Publikation im Quellsystem dieses Datasets gemeint. Falls dies nicht bekannt ist, verwenden Sie das Datum der geplanten ersten Publikation auf opendata.swiss.",
       "fr": "La date de création est un champ obligatoire. Il s'agit de la date de la première publication dans le système source de cet ensemble de données. Si celle-ci n'est pas connue, utilisez la date de la première publication prévue sur opendata.swiss.",
       "it": "La data di creazione è un campo obbligatorio. Questo significa la data della prima pubblicazione nel sistema di origine di questo set di dati. Se questo non è noto, utilizzare la data della prima pubblicazione prevista su opendata.swiss."
     }
    },
    {
      "field_name": "modified",
      "preset": "ogdch_date",
      "label": {
        "en": "Modification date",
        "de": "Änderungsdatum",
        "fr": "Date de la dernière modification",
        "it": "Data ultima modifica"
      },
      "help_text": {
        "de": "Beim Datum der letzten Änderung («geändert») können Sie nach der Publikation kommunizieren, wann die letzte Änderung (Aktualisierung mit neuen Ressourcen, Korrektur der Metadaten etc.) am Dataset vorgenommen worden ist.",
        "en": "With the modification date, you can communicate after publication when the last change (update with new resources, correction of metadata, etc.) was made to the dataset.",
        "fr": "Avec la date de la dernière modification, vous pouvez communiquer après la publication quand la dernière modification (mise à jour avec de nouvelles ressources, correction des métadonnées, etc.) a été apportée au jeu de données.",
        "it": "Con la data dell'ultima modifica, è possibile comunicare dopo la pubblicazione quando è stata fatta l'ultima modifica (aggiornamento con nuove risorse, correzione di metadati, ecc.) al dataset."
      }
    },
    {
      "field_name": "conforms_to",
      "preset": "multiple_text",
      "display_snippet": "multiple_urls.html",
      "validators": "scheming_required multiple_text ogdch_validate_list_of_uris",
      "output_validator": "scheming_load_json",
      "fieldgroup": {
        "en": "Conformance",
        "de": "Konformität",
        "fr": "Conformité",
        "it": "Conformità"
      },
      "label": {
        "en": "Conforms to",
        "de": "Entspricht",
        "fr": "Conforme à",
        "it": "Conforme a"
      },
      "form_placeholder_url": {
        "en": "Specification URI",
        "de": "Spezifikations-URI",
        "fr": "URI de spécification",
        "it": "URI di specifica"
      },
      "add_row": {
        "en": "Add another specification URI",
        "de": "Weitere Spezifikations-URI hinzufügen",
        "fr": "Ajouter une autre URI de spécification",
        "it": "Aggiungi un'altra URI di specifica"
      },
      "help_text": {
        "en": "Implementing rule (eg. INSPIRE) or other specification URLs e.g: https://inspire.ec.europa.eu/documents/commission-regulation-eu-no-13122014-10-december-2014-amending-regulation-eu-no-10892010-0.",
        "de": "Umsetzungsregel (z.B. INSPIRE) oder andere Spezifikations-URLs z.B: https://inspire.ec.europa.eu/documents/commission-regulation-eu-no-13122014-10-december-2014-amending-regulation-eu-no-10892010-0.",
        "fr": "Règle de mise en œuvre (par exemple INSPIRE) ou d'autres URL de spécifications, par exemple: https://inspire.ec.europa.eu/documents/commission-regulation-eu-no-13122014-10-december-2014-amending-regulation-eu-no-10892010-0.",
        "it": "Regola di implementazione (ad esempio INSPIRE) o altre URL di specifiche, ad esempio: https://inspire.ec.europa.eu/documents/commission-regulation-eu-no-13122014-10-december-2014-amending-regulation-eu-no-10892010-0."
      }
    },
    {
      "field_name": "accrual_periodicity",
      "preset": "select",
      "display_snippet": "periodicity.html",
      "validators": "scheming_required ogdch_temp_scheming_choices",
      "choices_helper": "ogdch_get_accrual_periodicity_choices",
      "label": {
        "en": "Update interval",
        "de": "Aktualisierungsintervall",
        "fr": "Intervalle d'actualisation",
        "it": "Intervallo di aggiornamento"
      },
      "help_text": {
        "de": "Das «Aktualisierungsintervall» ist das Intervall, in dem Aktualisierungen zu den Daten vorgenommen werden.",
        "en": "The \"update interval\" is the interval at which updates are made to the data.",
        "fr": "L'\"intervalle d'actualisation\" est l'intervalle auquel les mises à jour sur les données sont effectuées.",
        "it": "L'\"intervallo di aggiornamento\" è l'intervallo in cui vengono fatti gli aggiornamenti dei dati."
      }
    },
    {
      "field_name": "temporals",
      "preset": "temporals",
      "form_snippet": "temporals.html",
      "label": {
        "en": "Temporal coverage",
        "de": "Zeitliche Abdeckung",
        "fr": "Couverture temporelle",
        "it": "Copertura temporale"
      },
      "label_start_date": {
        "en": "from",
        "de": "von",
        "fr": "de",
        "it": "dal"
      },
      "label_end_date": {
        "en": "to",
        "de": "bis",
        "fr": "à",
        "it": "al"
      },
      "help_text": {
        "de": "Eine oder mehrere Zeitperioden, welche dieses Datasetabdeckt.",
        "en": "One or more time periods that this dataset covers.",
        "fr": "Une ou plusieurs périodes couvertes par ce jeu de données.",
        "it": "Uno o più periodi temporali che questo set di dati copre."
      },
      "add_row": {
        "en": "Add another temporal coverage",
        "de": "Eine weitere Zeitperiode hinzufügen",
        "fr": "Ajouter une autre période",
        "it": "Aggiungere un altro periodo di tempo"
      }
    },
    {
      "field_name": "publisher",
      "validators": "ogdch_validate_formfield_publisher",
      "display_snippet": "publisher.html",
      "form_snippet": "publisher.html",
      "mark_required": true,
      "section_title": {
        "en": "Publisher Information",
        "de": "Publisher-Informationen",
        "fr": "Informations relatives à l’éditeur",
        "it": "Dataset Information"
      },
      "name": {
        "en": "Name",
        "de": "Name",
        "fr": "Nom",
        "it": "Name"
      },
      "url": {
        "en": "URL",
        "de": "URL",
        "fr": "URL",
        "it": "URL"
      },
      "label": {
        "en": "Publisher Information",
        "de": "Publisher-Informationen",
        "fr": "Informations relatives à l’éditeur",
        "it": "Dataset Information"
      },
      "label_name": {
        "en": "Name",
        "de": "Name",
        "fr": "Nom",
        "it": "Nome"
      },
      "label_url": {
        "en": "URL",
        "de": "URL",
        "fr": "URL",
        "it": "URL"
      },
      "fieldgroup": {
        "en": "Publisher",
        "de": "Publisher",
        "fr": "Editeurs",
        "it": "Publisher"
      },
      "help_text": {
        "de": "Der Publisher dieses Datensatzes, d.h. die Organisation (z.B. Amt, Abteilung), welche den Datensatz veröffentlicht. Damit kann eine präzisere Information als die publizierende Hauptorganisation geliefert werden.",
        "en": "The publisher of this record, i.e. the organisation (e.g. office, department) that publishes the record. This can provide more precise information than the main publishing organisation.",
        "fr": "L'éditeur de ce jeu de données, c'est-à-dire l'organisation (par exemple, l’unité, le département) qui publie l'ensemble de données. Celui-ci peut fournir des informations plus précises que le principal organisme de publication.",
        "it": "L'editore di questo set di dati, cioè l'organizzazione (ad es. ufficio, dipartimento) che pubblica il set di dati. Questo può fornire informazioni più precise rispetto all'organizzazione editoriale principale."
      },
      "form_placeholder_name": {
        "en": "Publisher name",
        "de": "Publisher Name",
        "fr": "Éditeur",
        "it": "Nome Publisher"
      },
      "form_placeholder_url": {
        "en": "Publisher URL",
        "de": "Publisher URL",
        "fr": "Éditeur URL",
        "it": "URL Publisher"
      }
    },
    {
      "field_name": "contact_points",
      "validators": "harvest_list_of_dicts ogdch_validate_formfield_contact_points",
      "output_validators": "multiple_text_output",
      "form_snippet": "contact_points.html",
      "display_snippet": "contact_points.html",
      "mark_required": true,
      "fieldgroup": {
        "en": "Contact point",
        "de": "Kontaktstelle",
        "fr": "Point de contact",
        "it": "Punto di contatto"
      },
      "label": {
        "en": "Contact points",
        "de": "Kontaktstellen",
        "fr": "Points de contact",
        "it": "Punti di contatto"
      },
      "label_name": {
        "en": "Name",
        "de": "Name",
        "fr": "Nom",
        "it": "Nome"
      },
      "label_email": {
        "en": "Email",
        "de": "Email",
        "fr": "Courriel",
        "it": "Email"
      },
      "form_placeholder_name": {
        "en": "Name",
        "de": "Name",
        "fr": "Nom",
        "it": "Nome"
      },
      "form_placeholder_email": {
        "en": "Email",
        "de": "Email",
        "fr": "Email",
        "it": "Email"
      },
      "help_text": {
        "de": "Die Stelle, welche kontaktiert wird, falls eine Frage zum Datensatz besteht. Es können mehrere Kontaktstellen erfasst werden, mindestens eine Kontaktstelle ist erforderlich.",
        "en": "The contact point for questions about the dataset. Several contact points can be recorded, but at least one contact point is required.",
        "fr": "Le point de contact pour des questions concernant le dataset. Plusieurs points de contact peuvent être enregistrés, mais au moins un point de contact est requis.",
        "it": "Il punto di contatto per il dataset. Si possono registrare diversi punti di contatto, ma è necessario almeno un punto di contatto."
      },
      "add_row": {
        "en": "Add another contact point",
        "de": "Eine weitere Kontakstelle hinzufügen",
        "fr": "Ajouter un autre point de contact",
        "it": "Aggiungere un altro punto di contatto"
      }
    },
    {
      "field_name": "language",
      "preset": "languages",
      "choices": [
        {
          "value": "en",
          "label": {
            "en": "English",
            "de": "Englisch",
            "fr": "Anglais",
            "it": "Inglese"
          }
        },
        {
          "value": "de",
          "label": {
            "en": "German",
            "de": "Deutsch",
            "fr": "Allemand",
            "it": "Tedesco"
          }
        },
        {
          "value": "fr",
          "label": {
            "en": "French",
            "de": "Französisch",
            "fr": "Français",
            "it": "Francese"
          }
        },
        {
          "value": "it",
          "label": {
            "en": "Italian",
            "de": "Italienisch",
            "fr": "Italien",
            "it": "Italiano"
          }
        }
      ],
      "help_text": {
        "de": "Sprachen, in denen Ressourcen vorliegen. Falls die Ressourcen sprachunabhängig sind, soll nichts angekreuzt werden.",
        "en": "Languages in which resources are available. If the resources are language-independent, nothing should be selected.",
        "fr": "Langues dans lesquelles les ressources existent. Si les ressources sont indépendantes de la langue, rien ne doit être marqué.",
        "it": "Lingue in cui le risorse di dati sono disponibile. Se le risorse sono indipendenti dalla lingua, si prega di non selezionare nulla."
      },
      "label": {
        "en": "Languages",
        "de": "Sprachen",
        "fr": "Langues",
        "it": "Lingue"
      }
    },
    {
      "field_name": "url",
      "preset": "url",
      "mark_required": true,
      "label": {
        "en": "Url",
        "de": "Url",
        "fr": "Url",
        "it": "Url"
      },
      "form_placeholder": {
        "en": "Url",
        "de": "Url",
        "fr": "Url",
        "it": "Url"
      },
      "fieldgroup": {
        "en": "Landing page",
        "de": "Landing page",
        "fr": "Landing page",
        "it": "Landing page"
      },
      "help_text": {
        "de": "Mit «Landing Page» ist die Website gemeint, auf der die Daten ursprünglich publiziert wurden, falls diese vorhanden ist. Dort sollen weitere Informationen zu den Daten und zum Kontext vorhanden sein.",
        "en": "\"Landing page\" means the website where the data was originally published, if it exists. Further information on the data and the context should be available there.",
        "fr": "La «Landing page»: le site web où les données ont été initialement publiées, s'il existe. De plus amples informations sur les données et le contexte devraient y être disponibles.",
        "it": "Per \"Landing page\" si intende il sito web in cui i dati sono stati originariamente pubblicati, se questa esiste. Ulteriori informazioni sui dati e sul contesto dovrebbero essere disponibili lì."
      }
    },
    {
      "field_name": "relations",
      "validators": "harvest_list_of_dicts ogdch_validate_formfield_relations",
      "output_validators": "multiple_text_output",
      "form_snippet": "relations.html",
      "display_snippet": "relations.html",
      "section_title": {
        "en": "Further information",
        "de": "Weitere Informationen",
        "fr": "Informations complémentaires",
        "it": "Addizionali informazioni"
      },
      "fieldgroup": {
        "en": "Relations",
        "de": "Beziehungen",
        "fr": "Relation",
        "it": "Beziehungen"
      },
      "label": {
        "en": "Relations",
        "de": "Beziehungen",
        "fr": "Relation",
        "it": "Beziehungen"
      },
      "label_text": {
        "en": "Text",
        "de": "Text",
        "fr": "Text",
        "it": "Text"
      },
      "label_url": {
        "en": "Url",
        "de": "Url",
        "fr": "Url",
        "it": "Url"
      },
      "form_placeholder_text": {
        "en": "Text",
        "de": "Text",
        "fr": "Text",
        "it": "Text"
      },
      "form_placeholder_url": {
        "en": "Url",
        "de": "Url",
        "fr": "Url",
        "it": "Url"
      },
      "add_row": {
        "en": "Add another relation",
        "de": "Eine weitere Beziehung anfügen",
        "fr": "Eine weitere Beziehung anfügen",
        "it": "Eine weitere Beziehung anfügen"
      },
      "help_text": {
        "de": "Wichtig: Mittels dieses Felds soll auch eine Information zur gesetzlichen Grundlage veröffentlicht werden. Geben Sie bitte dazu «legal_basis» ein und erfassen einen Link auf die gesetzliche Grundlage, welche die Publikation dieses Datasets vorsieht.",
        "en": "Important: This field should also be used to publish information on the legal basis. Under \"Relationships\" please enter \"legal_basis\" and a link to the legal basis which provides for the publication of this dataset.",
        "fr": "Important : ce champ doit également être utilisé pour publier des informations sur la base juridique. Sous \"Relations\", veuillez saisir \"legal_basis\" et un lien vers la base juridique qui permet la publication de cet ensemble de données.",
        "it": "Importante: Questo campo è utilizzato anche per pubblicare informazioni sulla base legale. Sotto \"Relazioni\", inserire \"legal_basis\" e un link alla base giuridica che prevede la pubblicazione di questo dataset."
      }
    },
    {
      "field_name": "spatial",
      "label": {
        "en": "Spatial",
        "de": "Räumlich",
        "fr": "Spatial",
        "it": "Spaziale"
      },
      "form_snippet": null
    },
    {
      "field_name": "coverage",
      "label": {
        "en": "Coverage",
        "de": "Abdeckung",
        "fr": "Couverture",
        "it": "Copertura"
      },
      "form_snippet": null
    },
    {
      "field_name": "see_alsos",
      "validators": "harvest_list_of_dicts",
      "output_validators": "multiple_text_output",
      "form_snippet": null,
      "display_snippet": null
    },
    {
      "field_name": "qualified_relations",
      "validators": "harvest_list_of_dicts ogdch_validate_formfield_qualified_relations",
      "output_validators": "multiple_text_output",
      "form_snippet": "qualified_relations.html",
      "display_snippet": "qualified_relations.html",
      "fieldgroup": {
        "en": "Related datasets",
        "de": "Verwandte Datensätze",
        "fr": "Jeux de données relationnels",
        "it": "Set di dati relativi"
      },
      "help_text": {
        "de": "Unter «Verwandte Datensätze» können Sie aus allen verfügbaren Datasets auf opendata.swiss mit thematischem Bezug zu Ihrem aktuellen Dataset auswählen. Damit signalisieren Sie Datennutzenden, dass weitere Datasets existieren, die sie interessieren könnten.",
        "en": "Under \"Related datasets\" you can select from all available datasets on opendata.swiss that are thematically related to your current dataset. This way, you signal to data users that other datasets exist that might be of interest to them.",
        "fr": "Sous \"Jeux de données en relation\", vous pouvez choisir parmi tous les jeux de données disponibles sur opendata.swiss qui sont thématiquement liés à votre jeu de données actuel. De cette façon, vous signalez aux utilisateurs de données qu'il existe d'autres ensembles de données qui pourraient les intéresser.",
        "it": "Sotto \"Dataset correlati\" potete selezionare tra tutti i set di dati disponibili su opendata.swiss che sono tematicamente correlati al vostro set di dati attuale. In questo modo, si segnalano agli utenti dei dati che esistono altri set di dati che potrebbero essere di loro interesse."
      },
      "label": {
        "en": "Related datasets",
        "de": "Verwandte Datensätze",
        "fr": "Jeux de données relationnels",
        "it": "Set di dati relativi"
      },
      "label_form": {
        "en": "Name / Slug",
        "de": "Name / Slug",
        "fr": "Nom / Slug",
        "it": "Name / Slug"
      },
      "form_placeholder": {
        "en": "Name / Slug of a dataset",
        "de": "Name / Slug eines Datasets",
        "fr": "Name / Slug eines Datasets",
        "it": "Name / Slug eines Datasets"
      },
      "add_row": {
        "en": "Add another related dataset",
        "de": "Einen weiteren verwandten Dataset hinzufügen",
        "fr": "Einen weiteren verwandten Dataset hinzufügen",
        "it": "Einen weiteren verwandten Dataset hinzufügen"
      }
    },
    {
      "field_name": "documentation",
      "preset": "multiple_text",
      "display_snippet": "multiple_urls.html",
      "validators": "scheming_required multiple_text ogdch_validate_list_of_urls",
      "output_validator": "scheming_load_json",
      "fieldgroup": {
        "en": "Documentation",
        "de": "Dokumentation",
        "fr": "Documentation",
        "it": "Documentazione"
      },
      "label": {
        "en": "Documentation",
        "de": "Dokumentation",
        "fr": "Documentation",
        "it": "Documentazione"
      },
      "form_placeholder_url": {
        "en": "Documentation URL",
        "de": "Dokumentation URL",
        "fr": "Documentation URL",
        "it": "URL documentazione"
      },
      "add_row": {
        "en": "Add another documentation URL",
        "de": "Eine weitere Dokumentations-URL hinzufügen",
        "fr": "Ajouter une autre documentation URL",
        "it": "Aggiungere un altro URL documentazione"
      },
      "help_text": {
        "de": "A page or document about this dataset.",
        "en": "Eine Seite oder ein Dokument zu diesem Datensatz.",
        "fr": "Une page ou un document sur cet jeu de données.",
        "it": "Una pagina o un documento su questo set di dati."
      }
    },
    {
      "field_name": "keywords",
      "preset": "ogdch_fluent_tags",
      "fieldgroup": {
        "en": "Keywords",
        "de": "Schlagwörter",
        "fr": "Mots clés",
        "it": "Parole chiave"
      },
      "label": {
        "en": "Keywords",
        "de": "Schlagwörter",
        "fr": "Mots clés",
        "it": "Parole chiave"
      },
      "fieldgroup_help_text": {
        "de": "Schlagwörter helfen dabei, die Auffindbarkeit zu steigern. Mögliche Schlagwörter können Sie aus Ihren Metadaten oder Ihrem Quellsystem ermitteln.",
        "en": "Keywords help to increase findability. You can determine possible keywords from your metadata or your source system.",
        "fr": "Les mots-clés permettent d'accroître la facilité de recherche. Vous pouvez déterminer les mots-clés possibles à partir de vos métadonnées ou de votre système source..",
        "it": "Le parole chiave aiutano ad aumentare la reperibilità dei dati. Qui si possono determinare le possibili parole chiave a partire dai i metadati o dal sistema di origine."
      }
    }
  ],
  "resource_fields": [
    {
      "field_name": "identifier",
      "label": {
        "en": "Identifier (Permalink)",
        "de": "Identifier (Permalink)",
        "fr": "Identifier (Permalink)",
        "it": "Identifier (Permalink)"
      },
      "help_text": {
        "en": "Select a suitable identifier from your source system.",
        "de": "Wählen Sie einen geeigneten Identifier aus Ihrem Quellsystem aus.",
        "fr": "Choisissez un identifiant approprié dans votre système source.",
        "it": "Seleziona un identificatore adatto dal tuo sistema di origine."
      }
    },
    {
      "field_name": "title",
      "preset": "multilingual_text_full",
      "mark_required": true,
      "section_title": {
        "en": "Resource",
        "de": "Resource",
        "fr": "Resource",
        "it": "Risorsa"
      },
      "fieldgroup": {
        "en": "Title",
        "de": "Titel",
        "fr": "Titre",
        "it": "Titolo"
      },
      "help_text": {
        "de": "Bitte geben Sie einen Titel für Ihre Resource ein. Bitte besetzen Sie mindestens eine Landessprache und Englisch. Wenn der Titel leer gelassen wird, wird der Titel des Datensatzes verwendet.",
        "en": "Please enter a title for your resource. Please fill in at least one national language and English. If the title is left blank, the title of the record will be used.",
        "fr": "Veuillez entrer un titre pour votre ressource. Veuillez remplir au moins une langue nationale et l'anglais. Si le titre est laissé vide, le titre de l'enregistrement sera utilisé.",
        "it": "Inserire un titolo per la risorsa. Si prega di compilare almeno una lingua nazionale e l'inglese. Se il titolo viene lasciato vuoto, verrà usato il titolo del record."
      },
      "label": {
        "en": "Title",
        "de": "Titel",
        "fr": "Titre",
        "it": "Titolo"
      },
      "form_placeholder": {
        "en": "Title of the Resource",
        "de": "Titel der Resource",
        "fr": "Titre",
        "it": "Titolo"
      }
    },
    {
      "field_name": "display_name",
      "preset": "multilingual_text",
      "form_snippet": null,
      "label": {
        "en": "Display name",
        "de": "Anzeigename",
        "fr": "Nom d'affichage",
        "it": "Nome visualizzato"
      }
    },
    {
      "field_name": "description",
      "preset": "multilingual_markdown",
      "label": {
        "en": "Description",
        "de": "Beschreibung",
        "fr": "Description",
        "it": "Descrizione"
      },
      "help_text": {
        "de": "Bitte geben Sie einen Beschreibung für Ihre Resource ein. Bitte besetzen Sie mindestens eine Landessprache und Englisch. Wenn die Beschreibung leer gelassen wird, wird die Beschreibung des Datensatzes verwendet.",
        "en": "Please enter a description for your resource. Please fill in at least one national language and English. If the description is left blank, the description of the record will be used.",
        "fr": "Veuillez entrer une description pour votre ressource. Veuillez remplir au moins une langue nationale et l'anglais. Si la description est laissée en blanc, la description de l'enregistrement sera utilisée.",
        "it": "Inserisci una descrizione per la tua risorsa. Si prega di compilare almeno una lingua nazionale e l'inglese. Se la descrizione è lasciata in bianco, verrà usata la descrizione del record."
      }
    },
    {
      "field_name": "issued",
      "label": {
        "en": "Issued date",
        "de": "Erstellungsdatum",
        "fr": "Date de publication",
        "it": "Data di pubblicazione"
      },
      "preset": "ogdch_date",
      "required": false,
      "help_text": {
        "de": "Das Datum der Veröffentlichung dieser Ressource.",
        "en": "The date of publication of this resource.",
        "fr": "La date de publication de cette ressource.",
        "it": "La data di pubblicazione di questa risorsa."
      }
    },
    {
      "field_name": "modified",
      "preset": "ogdch_date",
      "label": {
        "en": "Modified date",
        "de": "Änderungsdatum",
        "fr": "Date de modification",
        "it": "Data di modifica"
      },
      "help_text": {
        "de": "Datum der letzten Änderung dieser Ressource.",
        "en": "Date of the last modification of this resource.",
        "fr": "Date de la dernière modification de cette ressource.",
        "it": "Data dell'ultima modifica di questa risorsa."
      }
    },
    {
      "field_name": "language",
      "preset": "languages",
      "choices": [
        {
          "value": "en",
          "label": {
            "en": "English",
            "de": "Englisch",
            "fr": "Anglais",
            "it": "Inglese"
          }
        },
        {
          "value": "de",
          "label": {
            "en": "German",
            "de": "Deutsch",
            "fr": "Allemand",
            "it": "Tedesco"
          }
        },
        {
          "value": "fr",
          "label": {
            "en": "French",
            "de": "Französisch",
            "fr": "Français",
            "it": "Francese"
          }
        },
        {
          "value": "it",
          "label": {
            "en": "Italian",
            "de": "Italienisch",
            "fr": "Italien",
            "it": "Italiano"
          }
        }
      ],
      "label": {
        "en": "Languages",
        "de": "Sprachen",
        "fr": "Langues",
        "it": "Lingue"
      },
      "help_text": {
        "de": "Sprachen, in denen Ressourcen vorliegen. Falls die Ressourcen sprachunabhängig sind, soll nichts angekreuzt werden.",
        "en": "Languages in which resources are available. If the resources are language-independent, nothing should be selected.",
        "fr": "Langues dans lesquelles les ressources existent. Si les ressources sont indépendantes de la langue, rien ne doit être marqué.",
        "it": "Lingue in cui le risorse di dati sono disponibile. Se le risorse sono indipendenti dalla lingua, si prega di non selezionare nulla."
      }
    },
    {
      "field_name": "url",
      "preset": "url",
      "validators": "scheming_required",
      "label": {
        "en": "Access URL",
        "de": "Zugangs-URL",
        "fr": "URL d'accès",
        "it": "URL d'accesso"
      },
      "help_text": {
        "de": "Die URL, über welche auf die Ressource zugegriffen werden kann. Dies kann entweder eine Download-URL oder eine API-URL sein. Falls eine Download-URL für diese Ressource angegeben wurde, muss diese ebenfalls in diesem Feld eingetragen werden.",
        "en": "The URL through which the resource can be accessed. This can be either a download URL or an API URL. If a download URL has been specified for this resource, it must also be entered in this field.",
        "fr": "L'URL par laquelle on peut accéder à la ressource. Il peut s'agir d'une URL de téléchargement ou d'une URL d'API. Si une URL de téléchargement a été spécifiée pour cette ressource, elle doit également être saisie dans ce champ.",
        "it": "L'URL attraverso il quale si può accedere alla risorsa. Questo può essere un URL di download o un URL API. Se è stato specificato un URL di download per questa risorsa, deve essere inserito anche in questo campo."
      }
    },
    {
      "field_name": "download_url",
      "preset": "url",
      "label": {
        "en": "Download URL",
        "de": "Download-URL",
        "fr": "URL de téléchargement",
        "it": "URL di download"
      },
      "help_text": {
        "de": "URL der Datei, falls die Ressource heruntergeladen werden kann.",
        "en": "URL of the file if the resource can be downloaded.",
        "fr": "URL du fichier, si la ressource peut être téléchargée.",
        "it": "URL del file, se la risorsa può essere scaricata."
      }
    },
    {
      "field_name": "rights",
      "preset": "select",
      "choices_helper": "ogdch_get_rights_choices",
      "validators": "scheming_required",
      "label": {
        "en": "Terms of use",
        "de": "Nutzungsbedingungen",
        "fr": "Conditions d'utilisation",
        "it": "Condizioni d'uso"
      },
      "help_text": {
        "de": "Wichtig: Alle Nutzungsbedingungen, welche nicht mit einem Stern (*) markiert sind, gelten als 'Closed Data'.",
        "en": "Important: All terms of use that are not marked with an asterisk (*) are considered 'Closed Data'.",
        "fr": "Important : Toutes les conditions d'utilisation qui ne sont pas marquées d'un astérisque (*) sont considérées comme des \"données fermées\".",
        "it": "Importante: Tutte le condizioni d'uso che non sono contrassegnate da un asterisco (*) sono considerate \"Dati chiusi\"."
      }
    },
    {
      "field_name": "license",
      "preset": "select",
      "choices_helper": "ogdch_get_license_choices",
      "validators": "ogdch_license_required",
      "required": true,
      "label": {
        "en": "License",
        "de": "Lizenz",
        "fr": "Licence",
        "it": "Licenza"
      }
    },
    {
      "field_name": "byte_size",
      "preset": "file_size",
      "label": {
        "en": "File size",
        "de": "Dateigrösse",
        "fr": "Taille du fichier",
        "it": "Grandezza dei dati"
      },
      "help_text": {
        "de": "Hier kann die «Grösse» der Ressource in Bytes angegeben werden.",
        "en": "Here the \"size\" of the resource can be specified in bytes.",
        "fr": "Ici, la \"taille\" de la ressource en Bytes peut être spécifiée.",
        "it": "Qui la \"dimensione\" della risorsa in byte può essere specificata."
      }
    },
    {
      "field_name": "media_type",
      "form_snippet": null,
      "label": {
        "en": "Format",
        "de": "Format",
        "fr": "Format",
        "it": "Formato"
      }
    },
    {
      "field_name": "format",
      "preset": "ogdch_resource_format_autocomplete",
      "label": {
        "en": "Format",
        "de": "Format",
        "fr": "Format",
        "it": "Formato"
      },
      "help_text": {
        "de": "Wählen Sie das Format, das dem Ihrer Ressourcen entspricht.",
        "en": "Choose the format that corresponds to that of your resources.",
        "fr": "Choisissez le format qui correspond à celui de vos ressources.",
        "it": "Scegliere il formato che corrisponde a quello delle tue risorse."
      }
    },
    {
      "field_name": "coverage",
      "label": {
        "en": "Coverage",
        "de": "Abdeckung",
        "fr": "Couverture",
        "it": "Copertura"
      }
    },
    {
      "field_name": "documentation",
      "preset": "multiple_text",
      "display_snippet": "multiple_urls.html",
      "validators": "scheming_required multiple_text ogdch_validate_list_of_urls",
      "output_validator": "scheming_load_json",
      "fieldgroup": {
        "en": "Documentation",
        "de": "Dokumentation",
        "fr": "Documentation",
        "it": "Documentazione"
      },
      "label": {
        "en": "Documentation",
        "de": "Dokumentation",
        "fr": "Documentation",
        "it": "Documentazione"
      },
      "form_placeholder_url": {
        "en": "Documentation URL",
        "de": "Dokumentation URL",
        "fr": "Documentation URL",
        "it": "URL documentazione"
      },
      "add_row": {
        "en": "Add another documentation URL",
        "de": "Eine weitere Dokumentations-URL hinzufügen",
        "fr": "Ajouter une autre documentation URL",
        "it": "Aggiungere un altro URL documentazione"
      },
      "help_text": {
        "de": "A page or document about this resource.",
        "en": "Eine Seite oder ein Dokument zu diesem Ressource.",
        "fr": "Une page ou un document sur cette ressource.",
        "it": "Una pagina o un documento su questa risorsa."
      }
    },
    {
      "field_name": "access_services",
      "preset": "multiple_text",
      "display_snippet": "multiple_urls.html",
      "validators": "scheming_required multiple_text ogdch_validate_list_of_urls",
      "output_validator": "scheming_load_json",
      "fieldgroup": {
        "en": "Access service",
        "de": "Zugangsservice",
        "fr": "Service d'accès",
        "it": "Servizio di accesso"
      },
      "label": {
        "en": "Access service",
        "de": "Zugangsservice",
        "fr": "Service d'accès",
        "it": "Servizio di accesso"
      },
      "form_placeholder_url": {
        "en": "Access service URL",
        "de": "Zugangsservice-URL",
        "fr": "URL du service d'accès",
        "it": "URL del servizio di accesso"
      },
      "add_row": {
        "en": "Add another access service URL",
        "de": "Eine weitere Zugangsservice-URL hinzufügen",
        "fr": "Ajouter une autre URL de service d'accès",
        "it": "Aggiungi un altro URL del servizio di accesso"
      },
      "help_text": {
        "de": "A data service that gives access to this resource.",
        "en": "Ein Datendienst, der Zugriff auf diese Ressource ermöglicht.",
        "fr": "Un service de données qui donne accès à cette ressource.",
        "it": "Un servizio dati che dà accesso a questa risorsa."
      }
    },
    {
      "field_name": "temporal_resolution",
      "display_snippet": "text.html",
      "validators": "scheming_required ogdch_validate_duration_type",
      "label": {
        "en": "Temporal Resolution",
        "de": "Zeitliche Auflösung",
        "fr": "Résolution temporelle",
        "it": "Risoluzione Temporale"
      },
      "help_text": {
        "de": "This property refers to the minimum time period resolvable in the Dataset distribution.",
        "en": "Diese Eigenschaft bezieht sich auf den minimal auflösbaren Zeitraum in der Verteilung des Datensatzes.",
        "fr": "Cette propriété se réfère à la période minimale résoluble dans la distribution du jeu de données.",
        "it": "Questa proprietà si riferisce al periodo temporale minimo risolvibile nella distribuzione del dataset."
      }
    }
  ]
}
