Repository: opendata-swiss/ckanext-switzerland-ng
Catalog: ckanext/switzerland/i18n/*/LC_MESSAGES/ckanext-switzerland.po
Languages: fr

source: Linked Data
fr: Données Liées (Linked Data)

source: Draft
fr: Brouillon

source: Categories
fr: Catégories

source: Keywords
fr: Mots-clés

source: Organizations
fr: Organisations

source: Political levels
fr: Entités politique

source: Terms of use
fr: Conditions d'utilisation

source: Type of content
fr: Type de contenu

source: Category
fr: Catégorie

source: Dataset not found
fr: Jeu de données introuvable

source: Confederation
fr: Confédération

source: Other
fr: Autre

source: Weekly
fr: Hebdomadaire

source: Annual
fr: Annuel

source: Semiannual
fr: Semestriel

source: Three times a year
fr: Trois fois par an

source: Biennial
fr: Biennal

source: Bimonthly
fr: Bimestriel

source: Biweekly
fr: Tous les quinze jours

source: Continuous
fr: Continuel

source: Daily
fr: Quotidien

source: Twice a day
fr: Deux fois par jour

source: Irregular
fr: Irrégulier

source: Monthly
fr: Mensuel

source: Semimonthly
fr: Bimensuel

source: Three times a month
fr: Trois fois par mois

source: Never
fr: Jamais

source: Provisional data
fr: Données provisoires

source: Quarterly
fr: Trimestriel

source: Triennial
fr: Triennal

source: Unknown
fr: Inconnu

source: Continuously updated
fr: Mise à jour continuelle

source: Semiweekly
fr: Bihebdomadaire

source: Three times a week
fr: Trois fois par semaine

source: Quinquennial
fr: Tous les cinq ans

source: Decennial
fr: Tous les dix ans

source: Hourly
fr: Toutes les heures

source: Quadrennial
fr: Tous les quatre ans

source: Bihourly
fr: Toutes les deux heures

source: Trihourly
fr: Toutes les trois heures

source: Bidecennial
fr: Tous les vingt ans

source: Tridecennial
fr: Tous les trente ans

source: Open use
fr: Utilisation libre

source: Open use. Must provide the source.
fr: Utilisation libre. Obligation d’indiquer la source.

source: Open use. Use for commercial purposes requires permission of the data owner.
fr: Utilisation libre. Utilisation à des fins commerciales uniquement avec l’autorisation du fournisseur des données.

source: Open use. Must provide the source. Use for commercial purposes requires permission of the data owner.
fr: Utilisation libre. Obligation d’indiquer la source. Utilisation commerciale uniquement avec l’autorisation du fournisseur des données.

source: Expecting list of strings, got "%s"
fr: Veuillez saisir une chaîne de caractères, vous avez indiqué "%s"

source: Expecting DD.MM.YYYY, got "%s"
fr: Veuillez saisir JJ.MM.AAAA, vous avez indiqué "%s"

source: The selected organization was not found.
fr: L'organisation sélectionnée est introuvable

source: Identifier is already in use, it must be unique.
fr: L'identifiant est déjà utilisé, or il doit être unique.

source: Dataset {} could not be found .
fr: Jeu de données {} introuvable

source: Add Category
fr: Ajouter une catégorie

source: View {name}
fr: Voir {name}

source: {num} Dataset
fr: {num} jeu de données

source: Publish
fr: Publier

source: Make draft
fr: Faire brouillon

source: Reset search
fr: Réinitialiser la recherche

source: Add datasets from XML
fr: Ajouter des jeux de données à partir de XML

source: Submit
fr: Soumettre

source: A CKAN Dataset is a collection of data resources (such as files), together with a description and other information, at a fixed URL. Datasets are what users see when searching for data.
fr: Un jeu de données correspond à une entrée sur le portail opendata.swiss. Publié ou structuré par une organisation, il est disponible pour téléchargement sous différentes formes de distribution («ressource» ou «distribution»). Sur opendata.swiss, une telle entrée correspond à des métadonnées de la classe dcat:Dataset (métadonnées d’un jeu de données) et décrit un seul jeu de données portant sur un certain thème.

source: Additional information
fr: Informations complémentaires

source: Add distributions
fr: Ajouter des distributions

source: Language independent
fr: Indépendant de la langue

source: Legal basis
fr: Base légale

source: Dataset Publication
fr: Publier le jeu de données

source: Public
fr: Publié

source: To publish the dataset: set its visibility to published
fr: Pour publier le jeu de données : définissez sa visibilité sur publié

source: Identifier
fr: Identifiant

source: Metadata Access
fr: Accès aux métadonnées

source: Download XML
fr: Télécharger XML

source: Here you can choose one or more categories to which the data set relates. Defining a category increases the findability of the data.
fr: Ici, vous pouvez choisir une ou plusieurs catégories auxquelles l'ensemble de données se rapporte. La définition d'une catégorie augmente la facilité de recherche des données.

source: No datasets could be found
fr: Aucun jeu de données trouvé

source: Datasets in this showcase
fr: Jeux de données dans le showcase

source: Remove from Showcase
fr: Supprimer le jeu de données de ce showcase

source: Add Showcase
fr: Ajouter un showcase

source: Datasets in Showcase
fr: Jeux de données dans le showcase

source: These datasets are not (yet) available on opendata.swiss.
fr: Ces jeux de données ne sont pas (encore) disponibles sur opendata.swiss.

source: Show More {facet_type}
fr: Montrer plus de {facet_type}

source: There are no {facet_type} that match this search
fr: Il n'y a pas de {facet_type} correspondant à cette recherche.

source: This dataset has no description
fr: Il n'y a pas de description pour ce jeu de données.

source: Search Filter
fr: Filtre de recherche

source: Order by
fr: Trier par

source: Please try another search.
fr: Veuillez essayer avec une autre requête.

source: There was an error while searching. Please try again.
fr: Une erreur est survenue pendant la recherche. Veuillez réessayer.

source: Search datasets...
fr: Rechercher les jeux de données...

source: {number} dataset found
fr: {number} jeu de données trouvé

source: No datasets found
fr: Aucun jeu de données trouvé

source: {number} category found
fr: {number} catégorie trouvée

source: No categories found
fr: Aucune catégorie trouvée

source: {number} organization found
fr: {number} organisation trouvée

source: No organizations found
fr: Aucune organisation trouvée

source: True
fr: Vraix

source: False
fr: Faux

source: Next: Add Distributions
fr: Suivant : Ajouter des distributions

source: Group not found
fr: Catégorie introuvable

source: Group has been deleted.
fr: Cette catégorie a été supprimé.

source: Group member has been deleted.
fr: Le membre de cette catégorie a été supprimé

source: {actor} updated the group {group}
fr: {actor} a mis à jour la catégorie {group}

source: {actor} deleted the group {group}
fr: {actor} a supprimé la catégorie {group}

source: {actor} created the group {group}
fr: {actor} a créé la catégorie {group}

source: You must be logged in to follow a group.
fr: Vous devez vous identifier pour suivre une catégorie.

source: Group was not found.
fr: Catégorie introuvable.

source: Add a Category
fr: Ajouter une catégorie

source: Are you sure you want to delete category - {name}?
fr: Êtes-vous sûr de vouloir supprimer la catégorie - {name}?

source: Search categories...
fr: Rechercher des catégories...

source: <p><strong>Admin:</strong> Can edit category information, as well as manage organization members.</p> <p><strong>Member:</strong> Can add/remove datasets from category</p>
fr: <p><strong>Administrateur:</strong> Peut éditer les informations de la catégorie, ainsi que gérer les membres d'organisations.</p> <p><strong>Membre:</strong> Peut ajouter/retirer des jeux de données de catégories</p>

source: Datasets in category: {group}
fr: Jeux de données de la catégorie : {group}

source: Are you sure you want to delete this Category?
fr: Etes-vous sûr de vouloir supprimer cette Catégorie?

source: Save Category
fr: Sauvegarder la Catégorie

source: Edit Category
fr: Modifier la Catégorie

source: Create a Category
fr: Créer une Catégorie

source: Update Category
fr: Modifier la catégorie

source: Create Category
fr: Créer la catégorie

source: Remove dataset from this category
fr: Supprimer le jeu de données de cette catégorie

source: What are Categories?
fr: Que sont les catégories ?

source: You can use CKAN Categories to create and manage collections of datasets. This could be to catalogue datasets for a particular project or team, or on a particular theme, or as a very simple way to help people find and search your own published datasets.
fr: Vous pouvez utiliser les catégories CKAN pour créer et gérer des collections de jeux de données. Cela peut être pour cataloguer des jeux de données pour un projet ou une équipe en particulier, ou autour d'un thème spécifique, ou comme moyen très simple d'aider à parcourir et découvrir vos jeux de données publiés.

source: category
fr: catégorie

source: categories
fr: catégories

source: Associate this category with this dataset
fr: Associer cette catégorie à un jeu de données

source: Add to category
fr: Ajouter au catégorie

source: There are no categories associated with this dataset
fr: Il n'y a pas de catégorie associé à ce jeu de données

source: Largest Categories
fr: Catégories les plus gros

source: No categories
fr: Pas de catégories

source: Login functions only with username, not e-mail address.
fr: La connexion fonctionne uniquement avec le nom d'utilisateur, pas avec l'adresse e-mail.

source: Data Last Modified
fr: Dernière modification des données

source: Metadata Last Modified
fr: Dernière modification des métadonnées
